/*
MySQL Backup
Database: search_question
Backup Time: 2022-05-19 10:27:42
*/

SET FOREIGN_KEY_CHECKS=0;
DROP TABLE IF EXISTS `search_question`.`log`;
DROP TABLE IF EXISTS `search_question`.`question_bank`;
CREATE TABLE `log` (
  `ip` varchar(255) DEFAULT NULL,
  `query` varchar(255) DEFAULT NULL,
  `date` datetime DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
CREATE TABLE `question_bank` (
  `title` varchar(127) DEFAULT NULL,
  `options` varchar(255) DEFAULT NULL,
  `solution` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
BEGIN;
LOCK TABLES `search_question`.`log` WRITE;
DELETE FROM `search_question`.`log`;
INSERT INTO `search_question`.`log` (`ip`,`query`,`date`) VALUES ('127.0.0.1', '计算机', '2022-05-16 16:09:42'),('0:0:0:0:0:0:0:1', '计算机', '2022-05-16 16:09:48'),('0:0:0:0:0:0:0:1', '计算机', '2022-05-16 16:14:27'),('0:0:0:0:0:0:0:1', '计算机', '2022-05-16 16:14:32'),('0:0:0:0:0:0:0:1', '计算机', '2022-05-16 16:14:34'),('0:0:0:0:0:0:0:1', '计算机', '2022-05-16 16:17:15'),('0:0:0:0:0:0:0:1', '计算机', '2022-05-16 16:20:23'),('0:0:0:0:0:0:0:1', '计算机', '2022-05-16 16:21:44'),('0:0:0:0:0:0:0:1', '计算机', '2022-05-16 16:21:46'),('0:0:0:0:0:0:0:1', '计算机', '2022-05-16 16:23:02'),('0:0:0:0:0:0:0:1', '计算机', '2022-05-16 16:31:30'),('0:0:0:0:0:0:0:1', '计算机', '2022-05-16 16:31:34'),('0:0:0:0:0:0:0:1', '计算机', '2022-05-16 16:31:38'),('127.0.0.1', '计算机', '2022-05-16 16:31:41'),('0:0:0:0:0:0:0:1', '计算机', '2022-05-16 16:31:42'),('0:0:0:0:0:0:0:1', '计算机', '2022-05-18 22:55:27'),('0:0:0:0:0:0:0:1', '计算机', '2022-05-18 22:56:04'),('0:0:0:0:0:0:0:1', '计算机', '2022-05-18 22:56:58'),('0:0:0:0:0:0:0:1', '计算机', '2022-05-18 22:57:01'),('0:0:0:0:0:0:0:1', '计算机', '2022-05-18 22:57:04'),('0:0:0:0:0:0:0:1', '计算机', '2022-05-19 10:06:50');
UNLOCK TABLES;
COMMIT;
BEGIN;
LOCK TABLES `search_question`.`question_bank` WRITE;
DELETE FROM `search_question`.`question_bank`;
INSERT INTO `search_question`.`question_bank` (`title`,`options`,`solution`) VALUES ('创业团队的类型', 'A . 虚拟网状创业团队B . 星状创业团队C . 网状创业团队D . 虚拟星状创业团队', 'BCD'),('硬件产品创业完全无法做精益创业探索', 'A. 对\nB. 错', '错'),('创业环境对创业的影响主要体现在：', 'A . 以创业成本的影响B . 对创业机会的影响C . 对产业布局的影响D . 对技术扩散方向和梯度转移的影响', 'BCD'),('创业的动因有很多，但创业结果直接取决于', 'A . 金钱B . 机会成本C . 人脉D . 坚持', 'D'),('完整的计算机系统由（　）组成', 'A．运算器、控制器、存储器、输入设备和输出设备\r\nB．主机和外部设备\r\nC．硬件系统和软件系统\r\nD．主机箱、显示器、键盘、鼠标、打印机', 'C'),('计算机信息计量单位中的K代表（  ）', 'A. 102 B. 210 C. 103 D. 28', 'B'),('组成计算机的CPU的两大部件是（  ）', 'A．运算器和控制器 B. 控制器和寄存器 C．运算器和内存 D. 控制器和内存', 'A'),('微型计算机的内存容量主要指（ ）的容量', 'A. RAM B. ROM C. CMOS D. Cache', 'A'),('计算机的三类总线中，不包括（ ）。', 'A．控制总线 B．地址总线 C．传输总线 D．数据总线', 'C'),('在计算机上插U盘的接口通常是（  ）标准接口。', 'A．UPS B．USP C．UBS D．USB', 'D'),('用C语言编写的程序需要用（  ）程序翻译后计算机才能识别。', 'A．汇编 B．编译 C．解释 D．连接', 'B'),('从本质上讲，计算机病毒是一种（　）。', 'A．细菌 　 B．文本 　　　　C．程序 　　　　　D．微生物', 'C'),('关于硬件系统和软件系统的概念，下列叙述不正确的是', 'A 计算机硬件系统的基本功能是接受计算机程序，并在程序控制下完成数据输入和数据输出任务\r\nB 软件系统建立在硬件系统的基础上，它使硬件功能得以充分发挥，并为用户提供一个操作方便、工作轻松的环境\r\nC 没有装配软件系统的计算机不能做任何工作，没有实际的使用价值\r\nD 一台计算机只要装入系统软件后，即可进行文字处理或数据处理工作\r\n', 'D'),('一个计算机网络组成包括', 'A 传输介质和通信设备\r\nB 通信子网和资源子网\r\nC 用户计算机和终端\r\nD 主机和通信处理机', 'B'),('目前计算机应用最广泛的领域是', 'A 人工智能和专家系统\r\nB 科学技术与工程计算\r\nC 数据处理与办公自动化\r\nD 辅助设计与辅助制造', 'C'),('微型计算机采用总线结构连接CPU、内存储器和外部设备，总线由三部分组成，它包括', 'A 数据总线、传输总线和通信总线\r\nB 地址总线、逻辑总线和信号总统\r\nC 控制总统、地址总线和运算总线\r\nD 数据总线。地址总线和控制总线', 'D'),('发现微型计算机染有病毒后，较为彻底的清除方法是', 'A 用查毒软件处理 B 用杀毒软件处理 C 删除磁盘文件 D 重新格式化磁盘', 'D'),('计算机中既可作为输入设备又可作为输出设备的是().', 'A:打印机\r\n\r\nB:显示器\r\n\r\nC:鼠标\r\n\r\nD:磁盘', 'D');
UNLOCK TABLES;
COMMIT;
